NixOS/benchmarks/HPC/openfoam/OpenFOAM-v2306/tutorials/combustion/reactingFoam/RAS/chokedNozzle/constant/reactionsGRI
species
(
    O2
    N2
)
;

reactions
{}


elements
();
